performance_tests/results/dashboard_report/statistics.json
{
  "HTTP Request - GET Research (/research.html)" : {
    "transaction" : "HTTP Request - GET Research (/research.html)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.4399999999999995,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 7.279079924297569,
    "receivedKBytesPerSec" : 90.71126847066532,
    "sentKBytesPerSec" : 1.8695293164943951
  },
  "HTTP Request - GET Homepage (/index.html)" : {
    "transaction" : "HTTP Request - GET Homepage (/index.html)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.920000000000001,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 14.0,
    "throughput" : 7.260055176419341,
    "receivedKBytesPerSec" : 71.44489844997823,
    "sentKBytesPerSec" : 1.8433733846377234
  },
  "HTTP Request - GET Advisories (/advisories.html)" : {
    "transaction" : "HTTP Request - GET Advisories (/advisories.html)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.3,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.4499999999999957,
    "pct3ResTime" : 4.0,
    "throughput" : 7.279079924297569,
    "receivedKBytesPerSec" : 71.51127347503275,
    "sentKBytesPerSec" : 1.8837462694715388
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 350,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5142857142857145,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 40.082455336692625,
    "receivedKBytesPerSec" : 374.1346036847229,
    "sentKBytesPerSec" : 10.328166156092534
  },
  "HTTP Request - GET AWS Monitoring (/monitoring.html)" : {
    "transaction" : "HTTP Request - GET AWS Monitoring (/monitoring.html)",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.4000000000000012,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.980000000000018,
    "throughput" : 20.034726859890476,
    "receivedKBytesPerSec" : 135.31266695605717,
    "sentKBytesPerSec" : 5.184768181514626
  },
  "HTTP Request - GET Dashboard (/dashboard.html)" : {
    "transaction" : "HTTP Request - GET Dashboard (/dashboard.html)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.7399999999999998,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 7.279079924297569,
    "receivedKBytesPerSec" : 94.26550671495123,
    "sentKBytesPerSec" : 1.876637792982967
  }
}